### Countries with co2 data in 1850
HUNGARY, 
CANADA,
USSR,
NORWAY,
SWEDEN,
DENMARK,
IRELAND,
SPAIN,
AUSTRIA,
NETHERLANDS,
POLAND,
BELGIUM,
GERMANY,
FRANCE,
USA,
UK

In [13]:
import pandas as pd
import numpy as np
import scipy as sp

In [17]:
# Store filepath in a variable: 
# parse_dates=["year"] or dtype=object
myCO2="myCO2.csv"
co2_df = pd.read_csv(myCO2,dtype=object)
co2_df.info()
co2_df.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17232 entries, 0 to 17231
Data columns (total 3 columns):
year       17232 non-null object
country    17232 non-null object
co2        17232 non-null object
dtypes: object(3)
memory usage: 404.0+ KB

   year         country   co2
0  1751  UNITED KINGDOM  2552
1  1752  UNITED KINGDOM  2553
2  1753  UNITED KINGDOM  2553
3  1754  UNITED KINGDOM  2554
4  1755  UNITED KINGDOM  2555

In [20]:
# convert co2 to a float
co2_df["co2"] = co2_df["co2"].astype(float)
co2_df.head(5)

   year         country     co2
0  1751  UNITED KINGDOM  2552.0
1  1752  UNITED KINGDOM  2553.0
2  1753  UNITED KINGDOM  2553.0
3  1754  UNITED KINGDOM  2554.0
4  1755  UNITED KINGDOM  2555.0

In [32]:
# Store filepath in a variable: 
# parse_dates=["year"] or dtype=object
myTmps="myYearTempsF.csv"
tmps_df = pd.read_csv(myTmps,dtype=object)
tmps_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45358 entries, 0 to 45357
Data columns (total 5 columns):
year                       45358 non-null object
country                    45358 non-null object
avg_yly_tmp_f              45358 non-null object
avg_yly_tmp_c              45358 non-null object
avg_yly_tmp_uncertainty    45358 non-null object
dtypes: object(5)
memory usage: 1.7+ MB

In [47]:
# convert temps to floats and country to upper case for merging
tmps_df["avg_yly_tmp_f"]= tmps_df["avg_yly_tmp_f"].astype(float)
tmps_df["avg_yly_tmp_c"]= tmps_df["avg_yly_tmp_c"].astype(float)
tmps_df["avg_yly_tmp_uncertainty"]= tmps_df["avg_yly_tmp_uncertainty"].\
                                      astype(float)
tmps_df["country"]= tmps_df["country"].apply(lambda x: x.upper())
tmps_df.info()
tmps_df.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45358 entries, 0 to 45357
Data columns (total 5 columns):
year                       45358 non-null object
country                    45358 non-null object
avg_yly_tmp_f              45358 non-null float64
avg_yly_tmp_c              45358 non-null float64
avg_yly_tmp_uncertainty    45358 non-null float64
dtypes: float64(3), object(2)
memory usage: 1.7+ MB

   year  country  avg_yly_tmp_f  avg_yly_tmp_c  avg_yly_tmp_uncertainty
0  1744  ALBANIA      57.311375      14.061875                 2.243000
1  1744  ANDORRA      53.892950      12.162750                 2.176625
2  1744  AUSTRIA      46.012550       7.784750                 2.080250
3  1744  BELARUS      46.579325       8.099625                 2.417750
4  1744  BELGIUM      51.225800      10.681000                 1.846375

In [45]:
# Merge the two dataframes on the "year" and "country" fields

co2_tmp_df = pd.merge(co2_df, tmps_df, on=(["year","country"]),\
                      how="inner", suffixes=("_x", "_y"))
print(len(co2_tmp_df.index))                     
co2_tmp_df.head(5)

12783

,year,country,co2,avg_yly_tmp_f,avg_yly_tmp_c,avg_yly_tmp_uncertainty
0,1751,UNITED KINGDOM,2552.0,47.897375,8.831875,1.592250
1,1752,UNITED KINGDOM,2553.0,43.259300,6.255167,1.773833
2,1753,UNITED KINGDOM,2553.0,47.166950,8.426083,3.807083
3,1754,UNITED KINGDOM,2554.0,47.009900,8.338833,3.258917
4,1755,UNITED KINGDOM,2555.0,46.498700,8.054833,4.423917

In [46]:
# Export file as an XLSX or CSV, w/o index, w/ header
co2_tmp_df.to_csv("../output/co2_tmp_1.csv", index=False, header=True)

In [56]:
check_counts = co2_tmp_df.groupby(["country"],\
                as_index=False)["avg_yly_tmp_f"].\
                count().rename(columns={"avg_yly_tmp_f":"count"})
check_counts.head(5)

       country  count
0  AFGHANISTAN     64
1      ALBANIA     80
2      ALGERIA    103
3      ANDORRA     23
4       ANGOLA     63

In [59]:
# Export file as an XLSX or CSV, w/o index, w/ header
check_counts.to_excel("../output/check_counts.xlsx",\
                    index=False, header=True)